In [1]:
import pandas as pd
import numpy as np

In [3]:
data=pd.read_csv('Custinfo.csv')

In [4]:
data

    Cust_id  Income  Age  Gender
0         1  460745   44    Male
1         2  248163   36  Female
2         3  408219   30    Male
3         4  699649   35  Female
4         5  151342   38    Male
5         6  182640   41  Female
6         7  324257   38    Male
7         8  338267   27  Female
8         9  555423   27  Female
9        10  948681   42    Male
10       11  368482   46    Male
11       12  493148   35  Female
12       13  640905   39  Female
13       14  260269   29    Male
14       15  721577   31  Female
15       16  108451   42    Male
16       17  168023   46  Female
17       18  138962   43    Male
18       19  444151   39  Female
19       20  489853   34    Male

In [5]:
data.mean()

C:\Users\sayal\AppData\Local\Temp\ipykernel_14108\531903386.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data.mean()

Cust_id        10.50
Income     407560.35
Age            37.10
dtype: float64

In [6]:
data.loc[:,'Age'].mean()

37.1

In [7]:
data.mean(axis=1)[0:4]

C:\Users\sayal\AppData\Local\Temp\ipykernel_14108\1453274113.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.mean(axis=1)[0:4]

0    153596.666667
1     82733.666667
2    136084.000000
3    233229.333333
dtype: float64

In [8]:
data.median()

C:\Users\sayal\AppData\Local\Temp\ipykernel_14108\4184645713.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data.median()

Cust_id        10.5
Income     388350.5
Age            38.0
dtype: float64

In [9]:
data.loc[:,'Age'].median()

38.0

In [12]:
data.mode()

    Cust_id  Income   Age  Gender
0         1  108451  27.0  Female
1         2  138962  35.0    Male
2         3  151342  38.0     NaN
3         4  168023  39.0     NaN
4         5  182640  42.0     NaN
5         6  248163  46.0     NaN
6         7  260269   NaN     NaN
7         8  324257   NaN     NaN
8         9  338267   NaN     NaN
9        10  368482   NaN     NaN
10       11  408219   NaN     NaN
11       12  444151   NaN     NaN
12       13  460745   NaN     NaN
13       14  489853   NaN     NaN
14       15  493148   NaN     NaN
15       16  555423   NaN     NaN
16       17  640905   NaN     NaN
17       18  699649   NaN     NaN
18       19  721577   NaN     NaN
19       20  948681   NaN     NaN

In [15]:
data['Age'].mode()

0    27
1    35
2    38
3    39
4    42
5    46
Name: Age, dtype: int64

In [16]:
data.min()

Cust_id         1
Income     108451
Age            27
Gender     Female
dtype: object

In [17]:
data.max()

Cust_id        20
Income     948681
Age            46
Gender       Male
dtype: object

In [18]:
data.std()

C:\Users\sayal\AppData\Local\Temp\ipykernel_14108\2723740006.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data.std()

Cust_id         5.916080
Income     225588.020146
Age             6.025385
dtype: float64

In [19]:
data.loc[:,'Age'].std()

6.025384897074604

In [20]:
data.std(axis=1)[0:4]

C:\Users\sayal\AppData\Local\Temp\ipykernel_14108\1389220895.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.std(axis=1)[0:4]

0    265998.260266
1    143266.006206
2    235675.823646
3    403931.280455
dtype: float64

#Summary statistics of income grouped by the age groups

In [22]:
data.groupby(['Gender'])['Age'].mean()

Gender
Female    35.6
Male      38.6
Name: Age, dtype: float64

In [27]:
df_u=data.rename(columns= {'Annual Income k$)':'Income'},inplace=False)

(df_u.groupby(['Gender']).Income.mean())

Gender
Female    449194.6
Male      365926.1
Name: Income, dtype: float64

#To create a list that contains a numeric value for each response to the categorical variable.

In [24]:
from sklearn import preprocessing
enc = preprocessing.OneHotEncoder()
enc_df = pd.DataFrame(enc.fit_transform(data[['Gender']]).toarray())
enc_df

      0    1
0   0.0  1.0
1   1.0  0.0
2   0.0  1.0
3   1.0  0.0
4   0.0  1.0
5   1.0  0.0
6   0.0  1.0
7   1.0  0.0
8   1.0  0.0
9   0.0  1.0
10  0.0  1.0
11  1.0  0.0
12  1.0  0.0
13  0.0  1.0
14  1.0  0.0
15  0.0  1.0
16  1.0  0.0
17  0.0  1.0
18  1.0  0.0
19  0.0  1.0

To concat numerical list to dataframe

In [28]:
df_encode =df_u.join(enc_df)
df_encode

    Cust_id  Income  Age  Gender    0    1
0         1  460745   44    Male  0.0  1.0
1         2  248163   36  Female  1.0  0.0
2         3  408219   30    Male  0.0  1.0
3         4  699649   35  Female  1.0  0.0
4         5  151342   38    Male  0.0  1.0
5         6  182640   41  Female  1.0  0.0
6         7  324257   38    Male  0.0  1.0
7         8  338267   27  Female  1.0  0.0
8         9  555423   27  Female  1.0  0.0
9        10  948681   42    Male  0.0  1.0
10       11  368482   46    Male  0.0  1.0
11       12  493148   35  Female  1.0  0.0
12       13  640905   39  Female  1.0  0.0
13       14  260269   29    Male  0.0  1.0
14       15  721577   31  Female  1.0  0.0
15       16  108451   42    Male  0.0  1.0
16       17  168023   46  Female  1.0  0.0
17       18  138962   43    Male  0.0  1.0
18       19  444151   39  Female  1.0  0.0
19       20  489853   34    Male  0.0  1.0

Display basic statistical details on the iris dataset.

In [35]:
iris = pd.read_csv('Iris.csv')

In [37]:
irisSet = (iris['Species']== 'Iris-setosa')

In [39]:
print('Iris-setosa')
print(iris[irisSet].describe())
irisVer = (iris['Species']== 'Iris-versicolor')
print('Iris-versicolor')
print(iris[irisVer].describe())
irisVir = (iris['Species']== 'Iris-virginica')
print('Iris-virginica')
print(iris[irisVir].describe())

Iris-setosa
             Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  50.00000       50.00000     50.000000      50.000000      50.00000
mean   25.50000        5.00600      3.418000       1.464000       0.24400
std    14.57738        0.35249      0.381024       0.173511       0.10721
min     1.00000        4.30000      2.300000       1.000000       0.10000
25%    13.25000        4.80000      3.125000       1.400000       0.20000
50%    25.50000        5.00000      3.400000       1.500000       0.20000
75%    37.75000        5.20000      3.675000       1.575000       0.30000
max    50.00000        5.80000      4.400000       1.900000       0.60000
Iris-versicolor
              Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count   50.00000      50.000000     50.000000      50.000000     50.000000
mean    75.50000       5.936000      2.770000       4.260000      1.326000
std     14.57738       0.516171      0.313798       0.469911      0.197753
min     51.00000       4.900000      2.000000       3.000000      1.000000
25%     63.25000       5.600000      2.525000       4.000000      1.200000
50%     75.50000       5.900000      2.800000       4.350000      1.300000
75%     87.75000       6.300000      3.000000       4.600000      1.500000
max    100.00000       7.000000      3.400000       5.100000      1.800000
Iris-virginica
              Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count   50.00000       50.00000     50.000000      50.000000      50.00000
mean   125.50000        6.58800      2.974000       5.552000       2.02600
std     14.57738        0.63588      0.322497       0.551895       0.27465
min    101.00000        4.90000      2.200000       4.500000       1.40000
25%    113.25000        6.22500      2.800000       5.100000       1.80000
50%    125.50000        6.50000      3.000000       5.550000       2.00000
75%    137.75000        6.90000      3.175000       5.875000       2.30000
max    150.00000        7.90000      3.800000       6.900000       2.50000